package lab4.Task8;
/*1. Метод getName() возвращает имя класса, включая полный путь к классу. Для массивов он возвращает имя, которое содержит символ '[' и тип элементов массива. Для примитивных типов возвращает имя примитивного типа, например, "int".

2. Метод getTypeName() возвращает имя класса в формате, который можно использовать при объявлении переменной этого типа. Для массивов он возвращает имя с использованием символов [], для примитивных типов возвращает имя типа, например, "int".

3. Метод getCanonicalName() возвращает каноническое имя класса в формате пакет.имя_класса. Для локальных и анонимных классов возвращает null.

4. Метод getSimpleName() возвращает простое имя класса. Для локальных и анонимных классов возвращает имя, а не тип.

5. Метод toString() возвращает строку, содержащую имя класса и хэш-код.

6. Метод getTypeParameters() возвращает список параметров типа в угловых скобках для обобщенных типов. Для других типов возвращает пустой массив.*/
public class Task8 {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
